[
  {
    "id": "COURSE01",
    "instructor": { "name": "Devid Roy", "picture": "https://i.ibb.co/DQRzm93/devid-roy.png" },
    "course_id": "c01",
    "course_name": "Web Development",
    "duration": "12 hrs 15 mins",
    "rating": 4.8,
    "lectures": 30,
    "language": "English",
    "enroll": 1622,
    "course_title": "Become A World Best Web Developer",
    "thumbnail": "https://i.ibb.co/TBZyjDm/web-development.png",
    "description": "Web development is the work involved in developing a website for the Internet (World Wide Web) or an intranet (a private network).[1] Web development can range from developing a simple single static page of plain text to complex web applications, electronic businesses, and social network services. A more comprehensive list of tasks to which Web development commonly refers, may include Web engineering, Web design, Web content development, client liaison, client-side/server-side scripting, Web server and network security configuration, and e-commerce development.Among Web professionals, 'Web development' usually refers to the main non-design aspects of building Web sites: writing markup and coding.[2] Web development may use content management systems (CMS) to make content changes easier and available with basic technical skills",
    "level": ["Beginner", "Intermediate", "Advanced"],
    "cost": 199.99

  },
  {
    "id": "COURSE02",
    "instructor": { "name": "Golayee", "picture": "https://i.ibb.co/StFgpZ3/golayee.png" },
    "course_id": "c02",
    "course_name": "Web Designing",
    "duration": "10 hrs 15 mins",
    "rating": 4.7,
    "lectures": 25,
    "language": "English",
    "enroll": 2505,
    "course_title": "Professional Web Designing Steps By Steps",
    "thumbnail": "https://i.ibb.co/QfY0jbN/web-designing.png",
    "description": "A web designer is responsible for creating the design and layout of a website or web pages. It and can mean working on a brand new website or updating an already existing site. Their role is different to web developers , who specialize in making web designs a reality or writing code that dictates how different parts of the website fit together. However, there can be crossover between the two roles.",
    "level": ["Beginner", "Intermediate", "Advanced"],
    "cost": 149.99

  },
  {
    "id": "COURSE03",
    "instructor": { "name": "Kanye Roy", "picture": "https://i.ibb.co/YkvKzqf/kanye.png" },
    "course_id": "c03",
    "course_name": "Software Engineer",
    "duration": "16 hrs 20 mins",
    "rating": 4.9,
    "lectures": 27,
    "language": "English",
    "enroll": 1045,
    "course_title": "Software Engineering All In One",
    "thumbnail": "https://i.ibb.co/sqqMx35/software-enginner.jpg",
    "description": "Software engineering is the branch of computer science that deals with the design, development, testing, and maintenance of software applications. Software engineers apply engineering principles and knowledge of programming languages to build software solutions for end users.Successful engineers know how to use the right programming languages, platforms, and architectures to develop everything from computer games to network control systems. In addition to building their own systems, software engineers also test, improve, and maintain software built by other engineers.",
    "level": ["Beginner", "Intermediate", "Advanced"],
    "cost": 399.99

  },
  {
    "id": "COURSE04",
    "instructor": { "name": "Kamran Hess", "picture": "https://i.ibb.co/BwkFj97/kamran-hess.png" },
    "course_id": "c04",
    "course_name": "Search Engine Optimization",
    "duration": "18 hrs 36 mins",
    "rating": 4.9,
    "lectures": 32,
    "language": "English",
    "enroll": 3452,
    "course_title": "SEO Professional Crush Course",
    "thumbnail": "https://i.ibb.co/Tmkx2X2/SEO.png",
    "description": "SEO stands for “search engine optimization.” In simple terms, it means the process of improving your site to increase its visibility when people search for products or services related to your business in Google, Bing, and other search engines. The better visibility your pages have in search results, the more likely you are to garner attention and attract prospective and existing customers to your business.Search engines such as Google and Bing use bots to crawl pages on the web, going from site to site, collecting information about those pages and putting them in an index. Think of the index like a giant library where a librarian can pull up a book (or a web page) to help you find exactly what you're looking for at the time.",
    "level": ["Beginner", "Intermediate", "Advanced"],
    "cost": 349.99

  },
  {
    "id": "COURSE05",
    "instructor": { "name": "John Smith", "picture": "https://i.ibb.co/7g94Fzv/john-smith.png" },
    "course_id": "c05",
    "course_name": "Mobile App Development",
    "duration": "14 hrs 15 mins",
    "rating": 4.8,
    "lectures": 30,
    "language": "English",
    "enroll": 4026,
    "course_title": "Beginner to Advanced Mobile App Developer",
    "thumbnail": "https://i.ibb.co/gwRn8TQ/mobile-app-development.png",
    "description": "Mobile app development is the act or process by which a mobile app is developed for mobile devices, such as personal digital assistants, enterprise digital assistants or mobile phones. These software applications are designed to run on mobile devices, such as a smartphone or tablet computer. These applications can be pre-installed on phones during manufacturing platforms, or delivered as web applications using server-side or client-side processing (e.g., JavaScript) to provide an experience within a web browser. Application software developers also must consider a long array of screen sizes, hardware specifications, and configurations because of intense competition in mobile software and changes within each of the platforms. Mobile app development has been steadily growing, in revenues and jobs created. A 2013 analyst report estimates there are 529,000 direct app economy jobs within the EU then 28 members (including the UK), 60 percent of which are mobile app developers.",
    "level": ["Beginner", "Intermediate", "Advanced"],
    "cost": 449.99

  },
  {
    "id": "COURSE06",
    "instructor": { "name": "Jasminne", "picture": "https://i.ibb.co/nQYHF3b/jasminne.png" },
    "course_id": "c06",
    "course_name": "Graphic Design",
    "duration": "15 hrs 15 mins",
    "rating": 4.7,
    "lectures": 28,
    "language": "English",
    "enroll": 1022,
    "course_title": "Become A Pro Graphic Designer",
    "thumbnail": "https://i.ibb.co/DWrFn4G/graphic-design.png",
    "description": "Graphic design is a craft where professionals create visual content to communicate messages. By applying visual hierarchy and page layout techniques, designers use typography and pictures to meet users specific needs and focus on the logic of displaying elements in interactive designs, to optimize the user experience. For instance, if an otherwise pleasing mobile app can't offer users what they need in several thumb-clicks, its designer/s will have failed to marry graphic design to user experience. The scope of graphic design in UX covers the creation of beautiful designs that users find highly pleasurable, meaningful and usable.",
    "level": ["Beginner", "Intermediate", "Advanced"],
    "cost": 349.99

  },
  {
    "id": "COURSE07",
    "instructor": { "name": "Devid Roy", "picture": "https://i.ibb.co/DQRzm93/devid-roy.png" },
    "course_id": "c07",
    "course_name": "Freelancing",
    "duration": "10 hrs 30 mins",
    "rating": 4.8,
    "lectures": 23,
    "language": "English",
    "enroll": 13000,
    "course_title": "Professional Freelancing Course",
    "thumbnail": "https://i.ibb.co/fXGbR0J/freelancing.png",
    "description": "Freelancing is a contract-based profession where instead of being recruited in an organization, the person uses his skills and experience to provide services to a number of clients.In simple terms, freelancing is when you use your skills, education, and experience to work with multiple clients and take on various assignments without committing to a single employer. The number of assignments or tasks that you can take just boils down to your ability to deliver on them as asked from them.A freelancer or freelance worker is a self-employed person who earns money by providing services to multiple clients. These services relate to the person's skills and are not necessarily provided to just businesses.",
    "level": ["Beginner", "Intermediate", "Advanced"],
    "cost": 249.99

  },
  {
    "id": "COURSE08",
    "instructor": { "name": "Sajjad Hussain", "picture": "https://i.ibb.co/T1gwLBg/sajjad-hussain.png" },
    "course_id": "c08",
    "course_name": "Digital Marketing",
    "duration": "14 hrs 15 mins",
    "rating": 4.9,
    "lectures": 26,
    "language": "English",
    "enroll": 2309,
    "course_title": "World Best Digital Marketing Course",
    "thumbnail": "https://i.ibb.co/GchcWZt/digital-marketing.png",
    "description": "Any marketing that uses electronic devices and can be used by marketing specialists to convey promotional messaging and measure its impact through your customer journey. In practice, digital marketing typically refers to marketing campaigns that appear on a computer, phone, tablet, or other device. It can take many forms, including online video, display ads, search engine marketing, paid social ads and social media posts. Digital marketing is often compared to “traditional marketing” such as magazine ads, billboards, and direct mail. Oddly, television is usually lumped in with traditional marketing.Digital marketing, also called online marketing, is the promotion of brands to connect with potential customers using the internet and other forms of digital communication. This includes not only email, social media, and web-based advertising, but also text and multimedia messages as a marketing channel.",
    "level": ["Beginner", "Intermediate", "Advanced"],
    "cost": 449.99

  },
  {
    "id": "COURSE09",
    "instructor": { "name": "Shrya Roy", "picture": "https://i.ibb.co/hC1B58r/shrya.png" },
    "course_id": "c09",
    "course_name": "Content Writing",
    "duration": "16 hrs 30 mins",
    "rating": 4.7,
    "lectures": 23,
    "language": "English",
    "enroll": 1208,
    "course_title": "All In One Content Writing Course",
    "thumbnail": "https://i.ibb.co/cT0swdP/content-writing.png",
    "description": "Content writing is the process of planning, writing and editing web content, typically for digital marketing purposes. It can include writing blog posts and articles, scripts for videos and podcasts, as well as content for specific platforms, such as tweetstorms on Twitter or text posts on Reddit.Creating an outline is a GREAT first step in the content writing process. Outlines help your content come out better for two main reasons: First, outlines force you to put all your thoughts down in an organized way (rather than writing everything off the top of your head). Which really speeds up the writing process. Second, outlines usually lead to a much better structure for your content. That's because an outline lets you see your content from a “high level” that's impossible to see as you're writing.",
    "level": ["Beginner", "Intermediate", "Advanced"],
    "cost": 399.99

  }
]
 


